Revit 2027 API
Element.CanHaveTypeAssigned(Document, ICollection<ElementId>) Method
 Checks if all elements in the set can have a type assigned.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanHaveTypeAssigned(
	Document document,
	ICollection<ElementId> elementIds
)
Public Shared Function CanHaveTypeAssigned (
	document As Document,
	elementIds As ICollection(Of ElementId)
) As Boolean
public:
static bool CanHaveTypeAssigned(
	Document^ document,
	ICollection<ElementId^>^ elementIds
)
static member CanHaveTypeAssigned :
        document : Document *
        elementIds : ICollection<ElementId> -> bool
Parameters
document Document
 The document.
elementIds ICollection<ElementId>
 A collection of element IDs.
Return Value
Boolean
 True if all elements in the set can have a type assigned, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  Thrown when at least one of the elements does not exist in the document.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Element Class
CanHaveTypeAssigned Overload
Autodesk.Revit.DB Namespace